#ifndef CALCULATOR_H
#define CALCULATOR_H

//Функция сложения возвращает целочисленный результат
//сложения двух чисел типа int
int add_m(int a, int b);

//Функция вычитания возвращает целочисленный результат
//вычитания двух чисел типа int
int sub_m(int a, int b);

//Функция умножения возвращает целочисленный результат
//умножения двух чисел типа int
int mul_m(int a, int b);

//Функция целочисленного деления возвращает результат
//деления двух чисел типа int
int div_m(int a, int b);

//Функция взятия остатка возвращает целочисленный результат
//остаток a от b
int mod_m(int a, int b);

//Функция возведения в степень возвращает целочисленный результат
//a в степени b
int pow_m(int a, int b);

#endif /* CALCULATOR_H */